Rails6-bookers2-debug-main/app/controllers/post_comments_controller.rb

  def create
    @books = Book.find(params[:book_id])
    @post_comment =current_user.post_comments.new(post_comment_params)
    @post_comment.book_id = @books.id
    @post_comment.save
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "ppp"], ["user_id", 4], ["book_id", 1], ["created_at", "2022-07-27 01:53:49.356604"], ["updated_at", "2022-07-27 01:53:49.356604"]]

  def destroy
    @books = Book.find(params[:book_id])
    @post_comment = PostComment.find_by(id: params[:id], book_id: params[:book_id])
    @post_comment.destroy
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "post_comments" WHERE "post_comments"."id" = ?  [["id", 1]]