Rails6-bookers2-debug-main/app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "introduction" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "444"], ["introduction", "444"], ["updated_at", "2022-07-25 06:41:41.525171"], ["id", 2]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)