Rails6-bookers2-debug-main/app/views/post_comments/_count.html.erb

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
コメント件数： <%= books.post_comments.count %>