Rails6-bookers2-debug-main/app/views/post_comments/_index.html.erb

  <tbody>
    <% books.post_comments.each do |post_comment| %>
---
SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]

        <td>
        <%= post_comment.created_at.strftime('%Y/%m/%d') %>
---
INSERT INTO "post_comments" ("comment", "user_id", "book_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["comment", "7"], ["user_id", 4], ["book_id", 1], ["created_at", "2022-08-01 09:03:42.738807"], ["updated_at", "2022-08-01 09:03:42.738807"]]