Rails6-bookers2-debug-main/app/views/books/_index.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
              <%= link_to book_favorites_path(book.id), method: :delete do %>
                ❤<%= book.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 2]]
---
              <%= link_to book_favorites_path(book.id), method: :post do %>
                ♡<%= book.favorites.count %>

SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
          </td>
        <td>コメント件数： <%= book.post_comments.count %> </td>