Rails6-bookers2-debug-main/app/views/books/show.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
              <%= link_to book_favorites_path(@books), method: :delete do %>
                ❤<%= @books.favorites.count %>

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", 1]]
---
              <%= link_to book_favorites_path(@books), method: :post do %>
                ♡<%= @books.favorites.count %>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 2]]
SELECT COUNT(*) FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
          <td>
            <p>コメント件数： <%= @books.post_comments.count %></p>

SELECT "post_comments".* FROM "post_comments" WHERE "post_comments"."book_id" = ?  [["book_id", 1]]
---
        <tbody>
          <% @books.post_comments.each do |post_comment| %>